{"class_name": "Model", "keras_version": "2.2.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 200], "name": "input_3", "sparse": false}, "inbound_nodes": [], "name": "input_3"}, {"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "embedding_2", "dtype": "float32", "output_dim": 50, "trainable": false, "embeddings_regularizer": null, "input_dim": 22000, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, 200], "activity_regularizer": null, "input_length": 200}, "inbound_nodes": [[["input_3", 0, 0, {}]]], "name": "embedding_2"}, {"class_name": "SpatialDropout1D", "config": {"rate": 0.4, "noise_shape": null, "trainable": true, "seed": null, "name": "spatial_dropout1d_3"}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]], "name": "spatial_dropout1d_3"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_7", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["spatial_dropout1d_3", 0, 0, {}]]], "name": "conv1d_7"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [3], "trainable": true, "name": "max_pooling1d_5", "pool_size": [3]}, "inbound_nodes": [[["conv1d_7", 0, 0, {}]]], "name": "max_pooling1d_5"}, {"class_name": "Dropout", "config": {"rate": 0.3, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_7"}, "inbound_nodes": [[["max_pooling1d_5", 0, 0, {}]]], "name": "dropout_7"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_8", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["dropout_7", 0, 0, {}]]], "name": "conv1d_8"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [3], "trainable": true, "name": "max_pooling1d_6", "pool_size": [3]}, "inbound_nodes": [[["conv1d_8", 0, 0, {}]]], "name": "max_pooling1d_6"}, {"class_name": "Dropout", "config": {"rate": 0.3, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_8"}, "inbound_nodes": [[["max_pooling1d_6", 0, 0, {}]]], "name": "dropout_8"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_9", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["dropout_8", 0, 0, {}]]], "name": "conv1d_9"}, {"class_name": "GlobalMaxPooling1D", "config": {"trainable": true, "name": "global_max_pooling1d_3"}, "inbound_nodes": [[["conv1d_9", 0, 0, {}]]], "name": "global_max_pooling1d_3"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_5", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["global_max_pooling1d_3", 0, 0, {}]]], "name": "dense_5"}, {"class_name": "Dropout", "config": {"rate": 0.3, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_9"}, "inbound_nodes": [[["dense_5", 0, 0, {}]]], "name": "dropout_9"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_6", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 6, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dropout_9", 0, 0, {}]]], "name": "dense_6"}], "input_layers": [["input_3", 0, 0]], "output_layers": [["dense_6", 0, 0]], "name": "model_3"}, "backend": "tensorflow"}